{
  "displayName": "Cohesive Clinical Solutions Prague",
  "vidGridId": null,
  "showVideo": false,
  "jobs": [
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1963558,
      "title": "Infection Control Preventionist",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1963558/Cohesive-Clinical-Solutions-Prague/Infection-Control-Preventionist",
      "createdUtc": "2023-09-20T15:41:53.483",
      "publishedDate": "2023-09-20T15:51:13.9466667",
      "description": "\u003Cp\u003EPart time\u003C/p\u003E\u003Cp\u003ENon-exempt\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EProvides surveillance of Hospital inpatient population for evidence of infection. Assists Nursing personnel in proper care of infected patients, including isolation procedures when indicated. Establishes and maintains a program of infection control training for Hospital personnel. Collects and compiles data on numbers and types of infections. Coordinates the infection control process to achieve compliance with state and other regulatory standards. Maintains oversight and administration of the Hospital’s Respiratory Protection Program.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cp\u003EChief Clinical Officer (CCO)\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E1) Serves as principal working member of the Infection Control committee.\u003C/p\u003E\u003Cp\u003E2) Responsible for influencing, coordinating, implementing, supervising, and evaluating the standards of care developed by the Committee.\u003C/p\u003E\u003Cp\u003E3) Conducts ongoing surveillance of infections in hospital patients and hospital personnel. Compiles and interprets the surveillance data.&nbsp;\u003C/p\u003E\u003Cp\u003E4) Investigates clusters of infections or changes in patterns of infection.&nbsp;\u003C/p\u003E\u003Cp\u003E5) Communicates data regarding hospital-related infections with appropriate department heads and works collaboratively with other departments to seek solutions to infection problems.&nbsp;\u003C/p\u003E\u003Cp\u003E6) Collaborates with all disciplines and departments in Hospital to incorporate infection control principles in policies and procedures in order to provide a safe environment for hospital patients and personnel.&nbsp;\u003C/p\u003E\u003Cp\u003E7) Continues self-education by reviewing current literature and attending workshops and formal courses.&nbsp;\u003C/p\u003E\u003Cp\u003E8) Report infections and/or communicable diseases to appropriate public health authority.&nbsp;\u003C/p\u003E\u003Cp\u003E9) Develops and updates isolation techniques according to current standards of practice to provide optimum care to patients with infections and provide protection for employees.&nbsp;\u003C/p\u003E\u003Cp\u003E10) Develops and presents in-service education programs on prevention and control of infection for hospital personnel. Acts as resource to hospital personnel on relation matters in conjunction with the Medical Staff.&nbsp;\u003C/p\u003E\u003Cp\u003E11) Monitors patient care activities to identify methods, techniques, equipment, supplies, products, procedures, and policies which could constitute a risk of originating or transmitting infection.\u003C/p\u003E\u003Cp\u003E12) Orients new hospital employees to Infection Control/Employee Health Program used in the Hospital.\u003C/p\u003E\u003Cp\u003E13) Performs crisis intervention/follow-p for relating to potential exposure to infectious diseases by employees and patients.\u003C/p\u003E\u003Cp\u003E14) Conducts surveillance of significant infections/health problems of employees.&nbsp;\u003C/p\u003E\u003Cp\u003E15) Maintains established departmental policies and procedures.\u003C/p\u003E\u003Cp\u003E16) Performs other associated duties as directed by Director and/or Administration.\u003C/p\u003E\u003Cp\u003E17) Demonstrates knowledge of disaster/emergency procedures and responds appropriately in emergency situations.\u003C/p\u003E\u003Cp\u003E18) Maintains oversight and administration of the Hospital’s Respiratory Protection Program.\u003C/p\u003E\u003Cp\u003E19) Demonstrates initiative in personal/professional development.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1963558/Cohesive-Clinical-Solutions-Prague/Infection-Control-Preventionist",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1963558",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cp\u003EGraduate of an accredited school of nursing\u003C/p\u003E\u003Cp\u003EKnowledge of theory, principles, techniques, and practice of professional nursing; of scientific principles and nursing research; of preparation, administration, and action of medications; of treatments and medical procedures; of counseling and teaching techniques; of medical equipment as it relates to patient care.&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003EWorking knowledge of aseptic techniques, prevention of control of infection, and principles of microbiology and epidemiology.&nbsp;\u003C/p\u003E\u003Cp\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/p\u003E\u003Cp\u003EAbility to communicate effectively both verbally and in writing on all levels.&nbsp;\u003C/p\u003E\u003Cp\u003E**Required educational levels call for proof at time of hire.\u003C/p\u003E\u003Cp\u003EMinimum 5 years previous nursing experience.\u003C/p\u003E\u003Cp\u003EEmergency Room experience preferred.&nbsp;\u003C/p\u003E\u003Cp\u003EDemonstrate leadership qualities, self-directed and willing to assume decision-making responsibilities.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cp\u003ELicensed as a Registered Nurse in the state of Oklahoma\u003C/p\u003E\u003Cp\u003EBLS and ACLS required upon hire\u003C/p\u003E\u003Cp\u003EPALS required within 90-days of employment\u003C/p\u003E\u003Cp\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": null,
      "jobTypes": "parttime",
      "jobTypesArray": ["Part-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1939313,
      "title": "COOK & DIETARY AIDE",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1939313/Cohesive-Clinical-Solutions-Prague/COOK-DIETARY-AIDE",
      "createdUtc": "2023-09-07T21:05:32.033",
      "publishedDate": "2023-09-07T21:18:56.54",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EThe cook/aide is responsible for preparing palatable, nourishing, well-balanced meals to meet the daily nutritional and special dietary needs for patients and/or residents. This position is responsible for the cleanliness and sanitation of the cooking area and stoves; and for preparing, operating, and maintaining all cooking equipment. This position is also responsible for preparing meals for patients’ families, employees and guest within the facility.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cp\u003EFood Service Supervisor&nbsp;\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E1) Prepares, maintains and ensures high quality food for consumption in accordance with predesigned recipes based on appropriate patient dietary restrictions and/or cafeteria menu.\u003C/p\u003E\u003Cp\u003E2) Maintains and handles food with highest concern toward safe handling and sanitation.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E3) Check patient diet cards and prepare food accordingly.\u003C/p\u003E\u003Cp\u003E4) Cover, label and date all left over foods. Make plan for use of these foods.\u003C/p\u003E\u003Cp\u003E5) Reviews menu daily to determine quantities of food and supply need for stock and reserve purposes.\u003C/p\u003E\u003Cp\u003E6) Reports and food substitutions, deviations or shortages to appropriate personnel.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E7) Ensures equipment is in good working condition and work area is maintained in a clean and sanitized state. Report any malfunctions immediately.\u003C/p\u003E\u003Cp\u003E8) Monitors and documents food/equipment temperatures as appropriate.&nbsp;\u003C/p\u003E\u003Cp\u003E9) Adapts to changing environment, e.g., staffing patterns and assignments. Required to work holidays and subject to adjusted patient census schedule.&nbsp;\u003C/p\u003E\u003Cp\u003E10) Take on additional tasks as needed and directed by the Dietary Supervisor, Dietitian, or Administration.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the hospital’s philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record.\u003C/li\u003E\u003Cli\u003EAdhere to dress code.&nbsp;\u003C/li\u003E\u003Cli\u003EEstablishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1939313/Cohesive-Clinical-Solutions-Prague/COOK-DIETARY-AIDE",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1939313",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.\u003C/li\u003E\u003Cli\u003EAbility to work both independently and cooperatively with team.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to follow simple direction or instruction.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHigh school graduate or equivalency.\u003C/li\u003E\u003Cli\u003EOne year of experience working in a kitchen setting preferred.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to use food conversion formulas as needed.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "Dietary",
      "jobTypes": "parttime",
      "jobTypesArray": ["Part-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1919922,
      "title": "HOUSE SHIFT SUPERVISOR",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1919922/Cohesive-Clinical-Solutions-Prague/HOUSE-SHIFT-SUPERVISOR",
      "createdUtc": "2023-08-29T14:03:50.663",
      "publishedDate": "2023-08-29T15:07:59.6866667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EThe House Shift Supervisor is responsible for the direct and indirect nursing care of all patients experiencing medically complex conditions, and with rehabilitation and/or wound care needs. He/she is also responsible for the overall direction and supervision of all nursing department personnel during his/her shift. Demonstrates the knowledge and skill to carry out the nursing process when providing care, treatment and services to patients. Satisfies the established standards of the nursing practice, supervises, delegates, and coordinates personnel assigned to the unit and patient care. Supervises the interdisciplinary value-focused care management system and assessed outcomes. Teamwork is promoted between physicians and personnel of other departments.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECCO\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPOSITION SUPERVISORY RESPONSIBILITIES\u003C/p\u003E\u003Cp\u003ESupervisory Positions may include:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E0 Registered Nurse 0 License Vocational Nurse or Licensed Practical Nurse\u003C/p\u003E\u003Cp\u003E0 Certified Nursing Assistant 0 Nurse Technician\u003C/p\u003E\u003Cp\u003E0 Monitor Tech 0 Unit Secretary.\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Function\u003C/p\u003E\u003Cp\u003ESupervises, coordinates and delegates the delivery of care, treatment and services provided by selected members of the healthcare team. Assesses the value risks, (clinical, perceptual and financial), to minimize the potential impact.&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003ECommunicates directly with patients, families, medical staff, nursing staff, interdisciplinary team members and department heads to coordinate care, treatment and services, improve organization and implementation of patient care to maintain quality of care. Evaluates patient outcomes and revises plan according to changes in patient needs.&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003EConducts performance improvement activities to monitor performance and to continuously improve quality. Participates in gathering and analyzing data for trends and to institute actions to resolve problems promptly.\u003C/p\u003E\u003Cp\u003EDevelops a comprehensive plan of care and discharge plan based on the nursing assessment and integration of the medical plan utilizing patient’s family and other health care tam members. Communicates effectively and appropriate to patient, family and other health care providers.\u003C/p\u003E\u003Cp\u003EAssess patient’s condition, learning needs and family dynamics based on systematic data collection utilizing assessment skills and tools appropriate to the respective practice area.&nbsp;\u003C/p\u003E\u003Cp\u003EDocument timely and accurately the delivery of health care and nursing process in accordance with specific unit standards and hospital nursing policy.&nbsp;\u003C/p\u003E\u003Cp\u003EMaintains clinical competency (to include age specific) by assuming responsib8ilty for acquiring knowledge and experiences and integrate, as appropriate, into patient care delivery based upon specific patient needs.&nbsp;\u003C/p\u003E\u003Cp\u003EParticipates in orientation and education of personnel and students\u003C/p\u003E\u003Cp\u003EAccess to Pharmacy after hours as required by law. Access limited to following safeguards: 1)successfully completed training and competency provided by Pharmacist 2)access is limited to a set of medications approved by MEC 3) Obtain two (2) signatures upon entry; a pharmacist and an RN and 4) Pharmacist will be available 24 hours a day to answer questions or review medications.&nbsp;&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to carry out the essential functions of this job (with or without reasonable accommodation).\u003C/li\u003E\u003Cli\u003EAccess continuing education opportunities appropriate to responsibilities.\u003C/li\u003E\u003Cli\u003EAccountable for leadership of staff as assigned, delegating and coordinating nursing care to achieve and measure quality, cost-effective outcomes\u003C/li\u003E\u003Cli\u003EChecks emergency equipment&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates competency in operation of critical care equipment\u003C/li\u003E\u003Cli\u003EDemonstrates critical thinking skills&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates procedures related to the use of nursing equipment and supplies.\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to needs of patients by complying with hospital policies.\u003C/li\u003E\u003Cli\u003EKnows the rationale for the effect of medications and treatments and correctly administer same.\u003C/li\u003E\u003Cli\u003EMaintains a safe and effective environment.\u003C/li\u003E\u003Cli\u003EMakes patient rounds to assess physical and emotional status and to initiate nursing intervention.\u003C/li\u003E\u003Cli\u003EObtains report from nurse being relieved from duty and provides report to nurse coming on duty. Keeps Nursing Unit manager or others as appropriate informed about patient’s status and related matters. Performs or supervises complete, timely, and accurate documentation of patient care.\u003C/li\u003E\u003Cli\u003EPerforms or supervises administration and documentation of medications, internal nutrition and treatments per physician’s order and accurately records all care provided.\u003C/li\u003E\u003Cli\u003EPerforms or supervises review of medication and treatment records for completeness, accuracy in transcription of physician orders and adherence to stop order policy.\u003C/li\u003E\u003Cli\u003EResponds to patient and family concern, ensures that each concern is documented and a resolution is initiated.&nbsp;\u003C/li\u003E\u003Cli\u003EResponsible for planning, organizing and evaluating care interventions and their effect on outcome\u003C/li\u003E\u003Cli\u003ESeeks out external resources through conferences, workshops, etc. as necessary. Shares professional knowledge with staff, managers and hospital personnel&nbsp;\u003C/li\u003E\u003Cli\u003ESupports staff, patient and family education to enhance knowledge, skills, and necessary behaviors to facilitate positive outcomes.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EUtilizes the nursing process, documentation, communication and technical skills, collaboration with physicians and other team members to meet performance requirements\u003C/li\u003E\u003Cli\u003EPromote the philosophy, mission and objectives of the Company within and to customers outside the hospital.\u003C/li\u003E\u003Cli\u003EDemonstrates satisfactory level of interpersonal skills to interact with facility and medical staff and Administration, patients, families customers, vendors and government agencies.\u003C/li\u003E\u003Cli\u003EAssure participation in relevant in-service training sessions, facility meetings and continuing educational opportunities appropriate to responsibilities.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.\u003C/li\u003E\u003Cli\u003EDemonstrates ability to prioritize tasks/responsibilities and compete duties within allotted time.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAppropriately accesses the resources of the company’s corporate offices for consultation and program development support. Seeks out external resources through conferences, workshops, etc. as necessary. Shares professional knowledge with staff, directors, managers and hospital personnel.\u003C/li\u003E\u003Cli\u003EParticipate in hospital wide patient safety program identifying risks to patient safety and reducing healthcare errors.\u003C/li\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EPerform other duties as assigned\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1919922/Cohesive-Clinical-Solutions-Prague/HOUSE-SHIFT-SUPERVISOR",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1919922",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to project a Professional Image.\u003C/li\u003E\u003Cli\u003EKnowledge of regulatory standards, compliance requirements and hospital policies and procedures.\u003C/li\u003E\u003Cli\u003EWorking knowledge and ability to apply professional standards of practice in job situations.\u003C/li\u003E\u003Cli\u003EStrong organizational and analytical skills.\u003C/li\u003E\u003Cli\u003EWorking knowledge of computer and software applications used in job functions. (Order entry, data entry).\u003C/li\u003E\u003Cli\u003EPersons who have been found guilty by a court of law of abusing, neglecting, or mistreating individuals in a health care related setting are ineligible for employment in this position.\u003C/li\u003E\u003Cli\u003EFreedom from illegal use of drugs.\u003C/li\u003E\u003Cli\u003EFreedom from use of and effects of use of drugs and alcohol in the workplace\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EGraduate from an accredited school of professional nursing.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EPrefer a Registered Nurse with supervisory experience in long-term acute care or geriatric nursing. Two or more years’ experience as a RN in acute care is preferred.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003ECompleted competency for entry into Drug Room after hours\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERegistered Nurse who is currently licensed to practice, in good standing, by the state of employment.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EBLS, PALS and ACLS required upon hire certifications&nbsp;\u003C/li\u003E\u003Cli\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret and write reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, the board and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to compute ratio, percent, rate, as well as the ability to create and interpret graphs.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret an extensive variety of technical instructions in statistical or diagram form and deal with several abstract and concrete variables.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with hospital policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": null,
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1885337,
      "title": "CERTIFIED NURSE ASSISTANT",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1885337/Cohesive-Clinical-Solutions-Prague/CERTIFIED-NURSE-ASSISTANT",
      "createdUtc": "2023-08-10T21:53:04.09",
      "publishedDate": "2023-08-11T13:03:34.3766667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EAssist licensed nursing personnel in providing patient care in assigned areas. Helps patients by supporting personal hygiene and daily living needs; providing comfort, transportation, and vital sign monitoring.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E1) Responsible for feeding patients (some patients will require direct feeding, while others may just need their meal tray brought to them and set up).\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E2) Provides oral care, nail care and basic hygiene for patients.&nbsp;\u003C/p\u003E\u003Cp\u003E3) Responsible for bathing and dressing of patients. Bathing may take the place in the form of a bed bath, shower, or tub.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E4) Responsible for helping patients to the restroom when needed. Often patients will need help moving on and off the toilet or bed pan.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E5) Changing of catheter bags and charting amounts\u003C/p\u003E\u003Cp\u003E6) Blood pressure, pulse, pulse oximetry, and temperature monitoring of patients.&nbsp;\u003C/p\u003E\u003Cp\u003E7) Answering call lights.\u003C/p\u003E\u003Cp\u003E8) Turning of bedridden patients. This is done to take the weight off of pressure points and prevent bedsores from occurring.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E9) Changing bedding and collecting soiled laundry.\u003C/p\u003E\u003Cp\u003E10) Light cleaning and organizing of patient room or area.\u003C/p\u003E\u003Cp\u003E11) Relaying and charting requested information. This may include moods, vital signs, meal consumption, liquid intake, and daily bowel movement and urine amounts.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E12) Relaying information to the next CNA on shift, or to the nurses in charge.\u003C/p\u003E\u003Cp\u003E13) Recreational activities, such as assisting with a walk outdoors or delivering reading material to patients.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E14) Post mortem care.&nbsp;\u003C/p\u003E\u003Cp\u003E15) Provides safe and effective nursing care rendered directly or indirectly.&nbsp;\u003C/p\u003E\u003Cp\u003E16) Courteous to all members of the hospital staff.\u003C/p\u003E\u003Cp\u003E17) Communicates with all members of the healthcare team.&nbsp;\u003C/p\u003E\u003Cp\u003E18) Certified to perform cardio-pulmonary resuscitation (CPR) and be knowledgeable of all critical access hospital emergency protocols. (OHA 310:667-39-9 e.7)\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E19) Perform other duties as assigned.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the companies/facilities philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003ESupport the facility goals and objectives.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record and follows all hospital rules, policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains open and effective communications with patients and their nurses, physicians, peers, supervisors, and students. Establishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003Cli\u003EAttends departmental meetings and in-services to stay current with the developments of the department and hospital.\u003C/li\u003E\u003Cli\u003EObserves that proper safety measures are enforced in the techniques used on patients receiving therapy. Maintains high safety standards in the facility.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1885337/Cohesive-Clinical-Solutions-Prague/CERTIFIED-NURSE-ASSISTANT",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1885337",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECertified as a CNA in the state of Oklahoma.\u003C/li\u003E\u003Cli\u003EBLS certification required within 90 days of employment.\u003C/li\u003E\u003Cli\u003EDemonstrates initiative, ability to work with others, and professional judgement.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.&nbsp;\u003C/li\u003E\u003Cli\u003ERequired educational levels call for proof at time of hire.\u003C/li\u003E\u003Cli\u003E2 years previous hospital experience preferred.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECertified as a Nurse Aide (CNA) in the state of Oklahoma.\u003C/li\u003E\u003Cli\u003EBLS certified.\u003C/li\u003E\u003Cli\u003EProof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language.\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and facility property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity, and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with facility policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": null,
      "jobTypes": "parttime",
      "jobTypesArray": ["Part-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1796586,
      "title": "REGISTERED NURSE",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1796586/Cohesive-Clinical-Solutions-Prague/REGISTERED-NURSE",
      "createdUtc": "2023-06-26T16:31:21.827",
      "publishedDate": "2023-07-13T17:06:41.4633333",
      "description": "\u003Cp\u003E\u003Cstrong\u003EPOSITION SUMMARY&nbsp;\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EA clinically competent Registered Nurse who coordinates and delivers professional nursing care to the acutely ill patient in all phases of life (newborn through geriatric) using the nursing process of assessment, planning, implementation, and evaluation. Effectively interacts with the patient, significant other(s), and other health team members while maintaining the standards of professional nursing.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EPosition Summary Expanded:\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ESUPERVISOR\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003EHospital Chief Clinical Officer (CCO)\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EJob Functions\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E1) Provides direct patient care. Acts as a patient advocate.\u003C/p\u003E\u003Cp\u003E2) Assumes responsibility and accountability for individual knowledge, skill, performance and behavior in accordance with unit standards of care.\u003C/p\u003E\u003Cp\u003E3) Maintains patient, employee, physician and corporate confidentiality, and respects the rights, privacy, and property of others.\u003C/p\u003E\u003Cp\u003E4) Demonstrates compliance with infection control guidelines hospital safety management program, including proper use of personal protective equipment.\u003C/p\u003E\u003Cp\u003E5) Ensures nursing care data is accurately documented in the patient care record.\u003C/p\u003E\u003Cp\u003E6) Provides patients, families, significant others with relevant health care education, instructions, and discharge planning.\u003C/p\u003E\u003Cp\u003E7) Maintains current competency in his/her specialty, including, but not limited to, those practices as outlined in the nursing competency program.\u003C/p\u003E\u003Cp\u003E8) Provides leadership/supervision to staff members and others assigned to the care of his/her patients.\u003C/p\u003E\u003Cp\u003E9) Assigns patient care responsibilities to members of the nursing staff.\u003C/p\u003E\u003Cp\u003E10) Collaborates effectively with patients, families, significant others, nurses, physicians, and other members of the health care team.\u003C/p\u003E\u003Cp\u003E11) Participates in the review/revision of nursing policies, procedures, standards of patient care and standards of nursing practices.\u003C/p\u003E\u003Cp\u003E12) Participates in the process of monitoring and evaluating the quality of care provided.\u003C/p\u003E\u003Cp\u003E13) Consistently presents a professional image and a caring attitude.\u003C/p\u003E\u003Cp\u003E14) Provides safe and effective nursing care to patients through the use of the nursing process.\u003C/p\u003E\u003Cp\u003E15) Exercises appropriate judgement and correct techniques in the performance of procedures, treatments, and drug administration.\u003C/p\u003E\u003Cp\u003E16) Utilizes measures to promote patient, visitor, and personnel safety.\u003C/p\u003E\u003Cp\u003E17) Demonstrates knowledge of disaster/emergency procedures and responds appropriately in emergency situations.\u003C/p\u003E\u003Cp\u003E18) Demonstrates initiative in personal/professional development.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EADDITIONAL RESPONSIBILITIES\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESeek out external resources through conferences, workshops, etc. as necessary.&nbsp;\u003C/li\u003E\u003Cli\u003EShare professional knowledge with hospital staff, board members, and administrator.\u003C/li\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the companies/facilities philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003ESupport the facility goals and objectives.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record and follows all hospital rules, policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains open and effective communications with patients and their nurses, physicians, peers, supervisors, and students. Establishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003Cli\u003EAttends departmental meetings and in-services to stay current with the developments of the department and hospital.\u003C/li\u003E\u003Cli\u003EObserves that proper safety measures are enforced in the techniques used on patients receiving therapy. Maintains high safety standards in the facility.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1796586/Cohesive-Clinical-Solutions-Prague/REGISTERED-NURSE",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1796586",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003E\u003Cstrong\u003EPOSITION QUALIFICATIONS\u003C/strong\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMinimum Qualifications\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EBLS, ACLS and PALS certification required upon hire and throughout employment.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates initiative, ability to work with others, and professional judgement.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKnowledge of theory, principles, techniques, and practice of professional nursing; of scientific principles and nursing research; of preparation, administration, and action of medications; of treatments and medical procedures; of counseling and teaching techniques; of medical equipment as it relates to patient care.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.&nbsp;\u003C/li\u003E\u003Cli\u003E**Required educational levels call for proof at time of hire.\u003C/li\u003E\u003Cli\u003E2 years previous hospital experience preferred.\u003C/li\u003E\u003Cli\u003EEmergency Room experience preferred.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELICENSURE/CERTIFICATION\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELicensed as a Registered Nurse in the state of Oklahoma\u003C/li\u003E\u003Cli\u003EBLS, ACLS and PALS certification required upon hire and throughout employment.&nbsp;\u003C/li\u003E\u003Cli\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003ELANGUAGE SKILLS\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EMATHEMATICAL SKILLS\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to compute ratio, percent, rate, as well as the ability to create and interpret graphs.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cstrong\u003EREASONING ABILITY&nbsp;\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret an extensive variety of technical instructions in statistical or diagram form and deal with several abstract and concrete variables.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cstrong\u003EINTERPERSONAL SKILLS\u003C/strong\u003E\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with hospital policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "Nursing",
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1827694,
      "title": "REGISTERED NURSE",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1827694/Cohesive-Clinical-Solutions-Prague/REGISTERED-NURSE",
      "createdUtc": "2023-07-12T21:15:57.54",
      "publishedDate": "2023-07-13T17:06:31.9066667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EA clinically competent Registered Nurse who coordinates and delivers professional nursing care to the acutely ill patient in all phases of life (newborn through geriatric) using the nursing process of assessment, planning, implementation, and evaluation. Effectively interacts with the patient, significant other(s), and other health team members while maintaining the standards of professional nursing.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cp\u003EChief Clinical Officer (COO)\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E1) Provides direct patient care. Acts as a patient advocate.\u003C/p\u003E\u003Cp\u003E2) Assumes responsibility and accountability for individual knowledge, skill, performance and behavior in accordance with unit standards of care.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E3) Maintains patient, employee, physician and corporate confidentiality, and respects the rights, privacy, and property of others.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E4) Demonstrates compliance with infection control guidelines hospital safety management program, including proper use of personal protective equipment.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E5) Ensures nursing care data is accurately documented in the patient care record.\u003C/p\u003E\u003Cp\u003E6) Provides patients, families, significant others with relevant health care education, instructions, and discharge planning.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E7) Maintains current competency in his/her specialty, including, but not limited to, those practices as outlined in the nursing competency program.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E8) Provides leadership/supervision to staff members and others assigned to the care of his/her patients.\u003C/p\u003E\u003Cp\u003E9) Assigns patient care responsibilities to members of the nursing staff.\u003C/p\u003E\u003Cp\u003E10) Collaborates effectively with patients, families, significant others, nurses, physicians, and other members of the health care team.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E11) Participates in the review/revision of nursing policies, procedures, standards of patient care and standards of nursing practices.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E12) Participates in the process of monitoring and evaluating the quality of care provided.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E13) Consistently presents a professional image and a caring attitude.\u003C/p\u003E\u003Cp\u003E14) Provides safe and effective nursing care to patients through the use of the nursing process.\u003C/p\u003E\u003Cp\u003E15) Exercises appropriate judgement and correct techniques in the performance of procedures, treatments, and drug administration.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E16) Utilizes measures to promote patient, visitor, and personnel safety.\u003C/p\u003E\u003Cp\u003E17) Demonstrates knowledge of disaster/emergency procedures and responds appropriately in emergency situations.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E18) Demonstrates initiative in personal/professional development.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESeek out external resources through conferences, workshops, etc. as necessary.&nbsp;\u003C/li\u003E\u003Cli\u003EShare professional knowledge with hospital staff, board members, and administrator.\u003C/li\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the companies/facilities philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003ESupport the facility goals and objectives.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record and follows all hospital rules, policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains open and effective communications with patients and their nurses, physicians, peers, supervisors, and students. Establishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003Cli\u003EAttends departmental meetings and in-services to stay current with the developments of the department and hospital.\u003C/li\u003E\u003Cli\u003EObserves that proper safety measures are enforced in the techniques used on patients receiving therapy. Maintains high safety standards in the facility.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1827694/Cohesive-Clinical-Solutions-Prague/REGISTERED-NURSE",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1827694",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EBLS, ACLS and PALS certification required upon hire and throughout employment.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates initiative, ability to work with others, and professional judgement.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKnowledge of theory, principles, techniques, and practice of professional nursing; of scientific principles and nursing research; of preparation, administration, and action of medications; of treatments and medical procedures; of counseling and teaching techniques; of medical equipment as it relates to patient care.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.&nbsp;\u003C/li\u003E\u003Cli\u003E**Required educational levels call for proof at time of hire.\u003C/li\u003E\u003Cli\u003E2 years previous hospital experience preferred.\u003C/li\u003E\u003Cli\u003EEmergency Room experience preferred.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELicensed as a Registered Nurse in the state of Oklahoma\u003C/li\u003E\u003Cli\u003EBLS, ACLS and PALS certification required upon hire and throughout employment.&nbsp;\u003C/li\u003E\u003Cli\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to compute ratio, percent, rate, as well as the ability to create and interpret graphs.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret an extensive variety of technical instructions in statistical or diagram form and deal with several abstract and concrete variables.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with hospital policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "MedSurg",
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1827713,
      "title": "COOK & DIETARY AIDE",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1827713/Cohesive-Clinical-Solutions-Prague/COOK-DIETARY-AIDE",
      "createdUtc": "2023-07-12T21:21:27.88",
      "publishedDate": "2023-07-13T17:06:21.4466667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EThe cook/aide is responsible for preparing palatable, nourishing, well-balanced meals to meet the daily nutritional and special dietary needs for patients and/or residents. This position is responsible for the cleanliness and sanitation of the cooking area and stoves; and for preparing, operating, and maintaining all cooking equipment. This position is also responsible for preparing meals for patients’ families, employees and guest within the facility.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cp\u003EFood Service Supervisor&nbsp;\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E1) Prepares, maintains and ensures high quality food for consumption in accordance with predesigned recipes based on appropriate patient dietary restrictions and/or cafeteria menu.\u003C/p\u003E\u003Cp\u003E2) Maintains and handles food with highest concern toward safe handling and sanitation.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E3) Check patient diet cards and prepare food accordingly.\u003C/p\u003E\u003Cp\u003E4) Cover, label and date all left over foods. Make plan for use of these foods.\u003C/p\u003E\u003Cp\u003E5) Reviews menu daily to determine quantities of food and supply need for stock and reserve purposes.\u003C/p\u003E\u003Cp\u003E6) Reports and food substitutions, deviations or shortages to appropriate personnel.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E7) Ensures equipment is in good working condition and work area is maintained in a clean and sanitized state. Report any malfunctions immediately.\u003C/p\u003E\u003Cp\u003E8) Monitors and documents food/equipment temperatures as appropriate.&nbsp;\u003C/p\u003E\u003Cp\u003E9) Adapts to changing environment, e.g., staffing patterns and assignments. Required to work holidays and subject to adjusted patient census schedule.&nbsp;\u003C/p\u003E\u003Cp\u003E10) Take on additional tasks as needed and directed by the Dietary Supervisor, Dietitian, or Administration.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the hospital’s philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record.\u003C/li\u003E\u003Cli\u003EAdhere to dress code.&nbsp;\u003C/li\u003E\u003Cli\u003EEstablishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1827713/Cohesive-Clinical-Solutions-Prague/COOK-DIETARY-AIDE",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1827713",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.\u003C/li\u003E\u003Cli\u003EAbility to work both independently and cooperatively with team.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to follow simple direction or instruction.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EHigh school graduate or equivalency.\u003C/li\u003E\u003Cli\u003EOne year of experience working in a kitchen setting preferred.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to use food conversion formulas as needed.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "Dietary",
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1827788,
      "title": "LICENSED PRACTICAL NURSE",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1827788/Cohesive-Clinical-Solutions-Prague/LICENSED-PRACTICAL-NURSE",
      "createdUtc": "2023-07-12T21:45:21.933",
      "publishedDate": "2023-07-13T17:05:43.6133333",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EA clinically competent Licensed Practical Nurse who coordinates and delivers professional nursing care to the acutely ill patient in all phases of life (newborn through geriatric) using the nursing process of assessment, planning, implementation, and evaluation. Effectively interacts with the patient, significant other(s), and other health team members while maintaining the standards of professional nursing. Responsible for assisting physicians/providers, patient preparation and basic screening procedures, to assure efficient patient flow in clinic.\u003C/p\u003E\u003Cp\u003E&nbsp;\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cp\u003EChief Clinical Officer\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E1) Assist the physician and mid-level providers with office practice.\u003C/p\u003E\u003Cp\u003E2) Prepare for patient appointments by obtaining required information such as lab results, results of radiological procedures, medical records, and other information as required.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E3) Assist Medical providers during outpatient surgical procedures and treatments:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EWriting orders and completing consent forms as needed for procedures and treatment\u003C/li\u003E\u003Cli\u003EOrdering supplies and equipment needed for each specialist procedures\u003C/li\u003E\u003Cli\u003EMaintaining a sterile environment during the outpatient procedure\u003C/li\u003E\u003Cli\u003EAssisting the physicians during the outpatient surgeries including invasive procedures\u003C/li\u003E\u003Cli\u003EMonitoring the patient during the treatment and procedures and providing nursing care as needed\u003C/li\u003E\u003Cli\u003EAssist with specimen collection and appropriate laboatory techniques to complete diagnostic tests\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E4) Schedule procedures and treatments the physician orders including CT scans, MRI, surgeries, or other procedures.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E5) Maintains records, reports, logs and statistics as required.&nbsp;\u003C/p\u003E\u003Cp\u003E6) Prepares equipment &amp; instruments for sterilization according to policy.\u003C/p\u003E\u003Cp\u003E7) Demonstrates and maintains current knowledge of medication and administers them according to policy and procedures including various injections. Maintains adequate stock of medications and orders needed.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E8) Follows procedures when distributing samples, calling in prescriptions and obtaining physician approval on refills.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E9) Maintains a safe environment for patients, customers, self and other employees.\u003C/p\u003E\u003Cp\u003E10) Adheres to clinic dress code, wearing your name badge. Identify yourself to patients and customers on the phone and in person. Responds to phone calls and messages in a timely manner.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E11) Participates in the review/revision of nursing policies, procedures, standards of patient care and standards of nursing practices.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E12) Attends necessary meetings on times and takes responsibility for the content if absent. Maintains professional growth and participates in additional training as needed.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E13) Consistently presents a professional image and a caring attitude.\u003C/p\u003E\u003Cp\u003E14) Provides safe and effective nursing care to patients through the use of the nursing process.\u003C/p\u003E\u003Cp\u003E15) Exercises appropriate judgement and correct techniques in the performance of procedures, treatments, and drug administration.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E16) Utilizes measures to promote patient, visitor, and personnel safety.\u003C/p\u003E\u003Cp\u003E17) Demonstrates knowledge of disaster/emergency procedures and responds appropriately in emergency situations.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E18) Participates in other assigned duties as designated by the Nursing Supervisor/Clinic Manager including referrals, pre-authorizations, pre-certifications are obtained for all patients evaluated at, or referred from the clinic.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ESeek out external resources through conferences, workshops, etc. as necessary.&nbsp;\u003C/li\u003E\u003Cli\u003EShare professional knowledge with hospital staff, board members, and administrator.\u003C/li\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the companies/facilities philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003ESupport the facility goals and objectives.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record and follows all hospital rules, policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains open and effective communications with patients and their nurses, physicians, peers, supervisors, and students. Establishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003Cli\u003EAttends departmental meetings and in-services to stay current with the developments of the department and hospital.\u003C/li\u003E\u003Cli\u003EObserves that proper safety measures are enforced in the techniques used on patients receiving therapy. Maintains high safety standards in the facility.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1827788/Cohesive-Clinical-Solutions-Prague/LICENSED-PRACTICAL-NURSE",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1827788",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EACLS and BLS required upon hire.\u003C/li\u003E\u003Cli\u003EPALS required within 90-days of employment&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates initiative, ability to work with others, and professional judgement.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EKnowledge of theory, principles, techniques, and practice of professional nursing; of scientific principles and nursing research; of preparation, administration, and action of medications; of treatments and medical procedures; of counseling and teaching techniques; of medical equipment as it relates to patient care.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.&nbsp;\u003C/li\u003E\u003Cli\u003E**Required educational levels call for proof at time of hire.\u003C/li\u003E\u003Cli\u003E2 years previous clinic experience preferred.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ELicensed as an LPN in the state&nbsp;\u003C/li\u003E\u003Cli\u003EBLS and ACLS required upon hire\u003C/li\u003E\u003Cli\u003EPALS required within 90-days of employment\u003C/li\u003E\u003Cli\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to compute ratio, percent, rate, as well as the ability to create and interpret graphs.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret an extensive variety of technical instructions in statistical or diagram form and deal with several abstract and concrete variables.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with hospital policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "Nursing",
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1827807,
      "title": "HOUSE SHIFT SUPERVISOR",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1827807/Cohesive-Clinical-Solutions-Prague/HOUSE-SHIFT-SUPERVISOR",
      "createdUtc": "2023-07-12T21:51:46.563",
      "publishedDate": "2023-07-13T17:05:13.6766667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EThe House Shift Supervisor is responsible for the direct and indirect nursing care of all patients experiencing medically complex conditions, and with rehabilitation and/or wound care needs. He/she is also responsible for the overall direction and supervision of all nursing department personnel during his/her shift. Demonstrates the knowledge and skill to carry out the nursing process when providing care, treatment and services to patients. Satisfies the established standards of the nursing practice, supervises, delegates, and coordinates personnel assigned to the unit and patient care. Supervises the interdisciplinary value-focused care management system and assessed outcomes. Teamwork is promoted between physicians and personnel of other departments.\u003C/p\u003E\u003Cp\u003E.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ESUPERVISOR\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECCO\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPOSITION SUPERVISORY RESPONSIBILITIES\u003C/p\u003E\u003Cp\u003ESupervisory Positions may include:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E0 Registered Nurse 0 License Vocational Nurse or Licensed Practical Nurse\u003C/p\u003E\u003Cp\u003E0 Certified Nursing Assistant 0 Nurse Technician\u003C/p\u003E\u003Cp\u003E0 Monitor Tech 0 Unit Secretary.\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Function\u003C/p\u003E\u003Cp\u003ESupervises, coordinates and delegates the delivery of care, treatment and services provided by selected members of the healthcare team. Assesses the value risks, (clinical, perceptual and financial), to minimize the potential impact.&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003ECommunicates directly with patients, families, medical staff, nursing staff, interdisciplinary team members and department heads to coordinate care, treatment and services, improve organization and implementation of patient care to maintain quality of care. Evaluates patient outcomes and revises plan according to changes in patient needs.&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003EConducts performance improvement activities to monitor performance and to continuously improve quality. Participates in gathering and analyzing data for trends and to institute actions to resolve problems promptly.\u003C/p\u003E\u003Cp\u003EDevelops a comprehensive plan of care and discharge plan based on the nursing assessment and integration of the medical plan utilizing patient’s family and other health care tam members. Communicates effectively and appropriate to patient, family and other health care providers.\u003C/p\u003E\u003Cp\u003EAssess patient’s condition, learning needs and family dynamics based on systematic data collection utilizing assessment skills and tools appropriate to the respective practice area.&nbsp;\u003C/p\u003E\u003Cp\u003EDocument timely and accurately the delivery of health care and nursing process in accordance with specific unit standards and hospital nursing policy.&nbsp;\u003C/p\u003E\u003Cp\u003EMaintains clinical competency (to include age specific) by assuming responsib8ilty for acquiring knowledge and experiences and integrate, as appropriate, into patient care delivery based upon specific patient needs.&nbsp;\u003C/p\u003E\u003Cp\u003EParticipates in orientation and education of personnel and students\u003C/p\u003E\u003Cp\u003EAccess to Pharmacy after hours as required by law. Access limited to following safeguards: 1)successfully completed training and competency provided by Pharmacist 2)access is limited to a set of medications approved by MEC 3) Obtain two (2) signatures upon entry; a pharmacist and an RN and 4) Pharmacist will be available 24 hours a day to answer questions or review medications.&nbsp;&nbsp;&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to carry out the essential functions of this job (with or without reasonable accommodation).\u003C/li\u003E\u003Cli\u003EAccess continuing education opportunities appropriate to responsibilities.\u003C/li\u003E\u003Cli\u003EAccountable for leadership of staff as assigned, delegating and coordinating nursing care to achieve and measure quality, cost-effective outcomes\u003C/li\u003E\u003Cli\u003EChecks emergency equipment&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates competency in operation of critical care equipment\u003C/li\u003E\u003Cli\u003EDemonstrates critical thinking skills&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates procedures related to the use of nursing equipment and supplies.\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to needs of patients by complying with hospital policies.\u003C/li\u003E\u003Cli\u003EKnows the rationale for the effect of medications and treatments and correctly administer same.\u003C/li\u003E\u003Cli\u003EMaintains a safe and effective environment.\u003C/li\u003E\u003Cli\u003EMakes patient rounds to assess physical and emotional status and to initiate nursing intervention.\u003C/li\u003E\u003Cli\u003EObtains report from nurse being relieved from duty and provides report to nurse coming on duty. Keeps Nursing Unit manager or others as appropriate informed about patient’s status and related matters. Performs or supervises complete, timely, and accurate documentation of patient care.\u003C/li\u003E\u003Cli\u003EPerforms or supervises administration and documentation of medications, internal nutrition and treatments per physician’s order and accurately records all care provided.\u003C/li\u003E\u003Cli\u003EPerforms or supervises review of medication and treatment records for completeness, accuracy in transcription of physician orders and adherence to stop order policy.\u003C/li\u003E\u003Cli\u003EResponds to patient and family concern, ensures that each concern is documented and a resolution is initiated.&nbsp;\u003C/li\u003E\u003Cli\u003EResponsible for planning, organizing and evaluating care interventions and their effect on outcome\u003C/li\u003E\u003Cli\u003ESeeks out external resources through conferences, workshops, etc. as necessary. Shares professional knowledge with staff, managers and hospital personnel&nbsp;\u003C/li\u003E\u003Cli\u003ESupports staff, patient and family education to enhance knowledge, skills, and necessary behaviors to facilitate positive outcomes.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EUtilizes the nursing process, documentation, communication and technical skills, collaboration with physicians and other team members to meet performance requirements\u003C/li\u003E\u003Cli\u003EPromote the philosophy, mission and objectives of the Company within and to customers outside the hospital.\u003C/li\u003E\u003Cli\u003EDemonstrates satisfactory level of interpersonal skills to interact with facility and medical staff and Administration, patients, families customers, vendors and government agencies.\u003C/li\u003E\u003Cli\u003EAssure participation in relevant in-service training sessions, facility meetings and continuing educational opportunities appropriate to responsibilities.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.\u003C/li\u003E\u003Cli\u003EDemonstrates ability to prioritize tasks/responsibilities and compete duties within allotted time.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAppropriately accesses the resources of the company’s corporate offices for consultation and program development support. Seeks out external resources through conferences, workshops, etc. as necessary. Shares professional knowledge with staff, directors, managers and hospital personnel.\u003C/li\u003E\u003Cli\u003EParticipate in hospital wide patient safety program identifying risks to patient safety and reducing healthcare errors.\u003C/li\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EPerform other duties as assigned\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1827807/Cohesive-Clinical-Solutions-Prague/HOUSE-SHIFT-SUPERVISOR",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1827807",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to project a Professional Image.\u003C/li\u003E\u003Cli\u003EKnowledge of regulatory standards, compliance requirements and hospital policies and procedures.\u003C/li\u003E\u003Cli\u003EWorking knowledge and ability to apply professional standards of practice in job situations.\u003C/li\u003E\u003Cli\u003EStrong organizational and analytical skills.\u003C/li\u003E\u003Cli\u003EWorking knowledge of computer and software applications used in job functions. (Order entry, data entry).\u003C/li\u003E\u003Cli\u003EPersons who have been found guilty by a court of law of abusing, neglecting, or mistreating individuals in a health care related setting are ineligible for employment in this position.\u003C/li\u003E\u003Cli\u003EFreedom from illegal use of drugs.\u003C/li\u003E\u003Cli\u003EFreedom from use of and effects of use of drugs and alcohol in the workplace\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EGraduate from an accredited school of professional nursing.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EPrefer a Registered Nurse with supervisory experience in long-term acute care or geriatric nursing. Two or more years’ experience as a RN in acute care is preferred.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003ECompleted competency for entry into Drug Room after hours\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ERegistered Nurse who is currently licensed to practice, in good standing, by the state of employment.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EBLS, PALS and ACLS required upon hire certifications&nbsp;\u003C/li\u003E\u003Cli\u003E*Proof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret and write reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, the board and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to compute ratio, percent, rate, as well as the ability to create and interpret graphs.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret an extensive variety of technical instructions in statistical or diagram form and deal with several abstract and concrete variables.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and hospital property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with hospital policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": "Nursing",
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    },
    {
      "vidGridId": null,
      "showVideo": false,
      "jobId": 1814902,
      "title": "CERTIFIED NURSE ASSISTANT",
      "companyName": "Prague Regional Memorial Hospital",
      "applyUrl": "https://recruiting.paylocity.com/recruiting/jobs/Apply/1814902/Cohesive-Clinical-Solutions-Prague/CERTIFIED-NURSE-ASSISTANT",
      "createdUtc": "2023-07-06T15:42:16.643",
      "publishedDate": "2023-07-06T18:04:28.3066667",
      "description": "\u003Cp\u003EPOSITION SUMMARY&nbsp;\u003C/p\u003E\u003Cp\u003EAssist licensed nursing personnel in providing patient care in assigned areas. Helps patients by supporting personal hygiene and daily living needs; providing comfort, transportation, and vital sign monitoring.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EPosition Summary Expanded:\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EUnder the Oklahoma Medical Marijuana and Patient Protection Act, (“The Unity Bill”) this position is considered a “Safety-sensitive position. “Safety-sensitive” is defined to include “any job that includes tasks or duties that could affect the safety and health of the employee performing the task or others.” Employees working in “safety-sensitive” roles are subject to this exception and subject to disciplinary action in the event of a positive test for marijuana or its metabolites.\u003C/p\u003E\u003Cp\u003EESSENTIAL FUNCTIONS AND RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ETo perform this job successfully, an individual must be able to perform each key function satisfactorily.\u003C/li\u003E\u003Cli\u003EEach category will be assessed on performance measurements of appropriateness, efficiency, effectiveness, and timeliness.&nbsp;\u003C/li\u003E\u003Cli\u003EReasonable accommodations may be made to enable individuals with disabilities to perform the key functions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EJob Functions\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E1) Responsible for feeding patients (some patients will require direct feeding, while others may just need their meal tray brought to them and set up).\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E2) Provides oral care, nail care and basic hygiene for patients.&nbsp;\u003C/p\u003E\u003Cp\u003E3) Responsible for bathing and dressing of patients. Bathing may take the place in the form of a bed bath, shower, or tub.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E4) Responsible for helping patients to the restroom when needed. Often patients will need help moving on and off the toilet or bed pan.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E5) Changing of catheter bags and charting amounts\u003C/p\u003E\u003Cp\u003E6) Blood pressure, pulse, pulse oximetry, and temperature monitoring of patients.&nbsp;\u003C/p\u003E\u003Cp\u003E7) Answering call lights.\u003C/p\u003E\u003Cp\u003E8) Turning of bedridden patients. This is done to take the weight off of pressure points and prevent bedsores from occurring.\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E9) Changing bedding and collecting soiled laundry.\u003C/p\u003E\u003Cp\u003E10) Light cleaning and organizing of patient room or area.\u003C/p\u003E\u003Cp\u003E11) Relaying and charting requested information. This may include moods, vital signs, meal consumption, liquid intake, and daily bowel movement and urine amounts.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E12) Relaying information to the next CNA on shift, or to the nurses in charge.\u003C/p\u003E\u003Cp\u003E13) Recreational activities, such as assisting with a walk outdoors or delivering reading material to patients.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E14) Post mortem care.&nbsp;\u003C/p\u003E\u003Cp\u003E15) Provides safe and effective nursing care rendered directly or indirectly.&nbsp;\u003C/p\u003E\u003Cp\u003E16) Courteous to all members of the hospital staff.\u003C/p\u003E\u003Cp\u003E17) Communicates with all members of the healthcare team.&nbsp;\u003C/p\u003E\u003Cp\u003E18) Certified to perform cardio-pulmonary resuscitation (CPR) and be knowledgeable of all critical access hospital emergency protocols. (OHA 310:667-39-9 e.7)\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003E19) Perform other duties as assigned.&nbsp;\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EADDITIONAL RESPONSIBILITIES\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EComply with HIPAA regulatory requirements.&nbsp;\u003C/li\u003E\u003Cli\u003EAdhere to the companies/facilities philosophy, mission, and policies and procedures.\u003C/li\u003E\u003Cli\u003ESupport the facility goals and objectives.\u003C/li\u003E\u003Cli\u003EMaintains a good attendance record and follows all hospital rules, policies and procedures.\u003C/li\u003E\u003Cli\u003EMaintains open and effective communications with patients and their nurses, physicians, peers, supervisors, and students. Establishes and maintains excellent interdepartmental and interpersonal relationships.\u003C/li\u003E\u003Cli\u003EAttends departmental meetings and in-services to stay current with the developments of the department and hospital.\u003C/li\u003E\u003Cli\u003EObserves that proper safety measures are enforced in the techniques used on patients receiving therapy. Maintains high safety standards in the facility.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "displayUrl": "https://recruiting.paylocity.com/recruiting/jobs/Details/1814902/Cohesive-Clinical-Solutions-Prague/CERTIFIED-NURSE-ASSISTANT",
      "jobLocation": {
        "name": "Prague",
        "address": "1322 Klabzuba Ave",
        "address2": null,
        "city": "Prague",
        "state": "OK",
        "zip": "74864",
        "metro": null,
        "locationDisplayName": "Prague"
      },
      "jobCode": "1814902",
      "listUrl": "https://recruiting.paylocity.com/recruiting/jobs/All/2a7678a8-2dd5-4c04-9294-a160f6f6c727/Cohesive-Clinical-Solutions-Prague",
      "requirements": "\u003Cp\u003EPOSITION QUALIFICATIONS\u003C/p\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMINIMUM QUALIFICATIONS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECertified as a CNA in the state of Oklahoma.\u003C/li\u003E\u003Cli\u003EBLS certification required within 90 days of employment.\u003C/li\u003E\u003Cli\u003EDemonstrates initiative, ability to work with others, and professional judgement.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EEDUCATION AND/OR EXPERIENCE&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to operate and handle many kinds of complex equipment.&nbsp;&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to demonstrate clinical competence and maintain current knowledge in caring for pediatric through geriatric patients.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to communicate effectively both verbally and in writing.&nbsp;\u003C/li\u003E\u003Cli\u003ERequired educational levels call for proof at time of hire.\u003C/li\u003E\u003Cli\u003E2 years previous hospital experience preferred.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELICENSURE/CERTIFICATION\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ECertified as a Nurse Aide (CNA) in the state of Oklahoma.\u003C/li\u003E\u003Cli\u003EBLS certified.\u003C/li\u003E\u003Cli\u003EProof of all required License(s) and Certification(s) is due at time of hire.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003ELANGUAGE SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EEnglish is the primary language.\u003C/li\u003E\u003Cli\u003EAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures or governmental regulations.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to interpret reports, business correspondence, and policy/procedure manuals.&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to effectively present information and respond to questions from groups of managers, physicians, clients, customers, employees, and the public.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EMATHEMATICAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals.&nbsp;&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E\u003Cp\u003EREASONING ABILITY&nbsp;\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EAbility to apply common sense understanding to carry out instruction furnished in written, oral, and/or diagram form.&nbsp;&nbsp;\u003C/li\u003E\u003Cli\u003EAbility to define and solve problems, collect data, establish facts, and draw valid conclusions.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EINTERPERSONAL SKILLS\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EDemonstrates active listening techniques.\u003C/li\u003E\u003Cli\u003EGains support through effective relationships.\u003C/li\u003E\u003Cli\u003ETreats others with dignity and respect; seeks feedback.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates honesty and integrity at all times in care and use of patient and facility property.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates and understands the importance of and respect for the rights, dignity, and individuality of each patient in all interactions.&nbsp;\u003C/li\u003E\u003Cli\u003EDemonstrates respect for co-workers and responds to the needs of patients by complying with facility policies.&nbsp;\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E\u003Cbr/\u003E\u003C/p\u003E",
      "salaryDescription": null,
      "hiringDepartment": null,
      "jobTypes": "fulltime",
      "jobTypesArray": ["Full-time"]
    }
  ]
}
